TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFPUD register
//
//*************************************************************************************************
#define GPIO_GPFPUD_GPIO160   0x1U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO161   0x2U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO162   0x4U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO163   0x8U     // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO164   0x10U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO165   0x20U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO166   0x40U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO167   0x80U    // Pull-Up Disable control for this pin
#define GPIO_GPFPUD_GPIO168   0x100U   // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFINV register
//
//*************************************************************************************************
#define GPIO_GPFINV_GPIO160   0x1U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO161   0x2U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO162   0x4U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO163   0x8U     // Input inversion control for this pin
#define GPIO_GPFINV_GPIO164   0x10U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO165   0x20U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO166   0x40U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO167   0x80U    // Input inversion control for this pin
#define GPIO_GPFINV_GPIO168   0x100U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFODR register
//
//*************************************************************************************************
#define GPIO_GPFODR_GPIO160   0x1U     // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO161   0x2U     // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO162   0x4U     // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO163   0x8U     // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO164   0x10U    // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO165   0x20U    // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO166   0x40U    // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO167   0x80U    // Output Open-Drain control for this pin
#define GPIO_GPFODR_GPIO168   0x100U   // Output Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPFGMUX1_GPIO160_S   0U
#define GPIO_GPFGMUX1_GPIO160_M   0x3U       // Defines pin-muxing selection for GPIO160
#define GPIO_GPFGMUX1_GPIO161_S   2U
#define GPIO_GPFGMUX1_GPIO161_M   0xCU       // Defines pin-muxing selection for GPIO161
#define GPIO_GPFGMUX1_GPIO162_S   4U
#define GPIO_GPFGMUX1_GPIO162_M   0x30U      // Defines pin-muxing selection for GPIO162
#define GPIO_GPFGMUX1_GPIO163_S   6U
#define GPIO_GPFGMUX1_GPIO163_M   0xC0U      // Defines pin-muxing selection for GPIO163
#define GPIO_GPFGMUX1_GPIO164_S   8U
#define GPIO_GPFGMUX1_GPIO164_M   0x300U     // Defines pin-muxing selection for GPIO164
#define GPIO_GPFGMUX1_GPIO165_S   10U
#define GPIO_GPFGMUX1_GPIO165_M   0xC00U     // Defines pin-muxing selection for GPIO165
#define GPIO_GPFGMUX1_GPIO166_S   12U
#define GPIO_GPFGMUX1_GPIO166_M   0x3000U    // Defines pin-muxing selection for GPIO166
#define GPIO_GPFGMUX1_GPIO167_S   14U
#define GPIO_GPFGMUX1_GPIO167_M   0xC000U    // Defines pin-muxing selection for GPIO167
#define GPIO_GPFGMUX1_GPIO168_S   16U
#define GPIO_GPFGMUX1_GPIO168_M   0x30000U   // Defines pin-muxing selection for GPIO168

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL1 register
//
//*************************************************************************************************
#define GPIO_GPFCSEL1_GPIO160_S   0U
#define GPIO_GPFCSEL1_GPIO160_M   0xFU          // GPIO160 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO161_S   4U
#define GPIO_GPFCSEL1_GPIO161_M   0xF0U         // GPIO161 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO162_S   8U
#define GPIO_GPFCSEL1_GPIO162_M   0xF00U        // GPIO162 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO163_S   12U
#define GPIO_GPFCSEL1_GPIO163_M   0xF000U       // GPIO163 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO164_S   16U
#define GPIO_GPFCSEL1_GPIO164_M   0xF0000U      // GPIO164 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO165_S   20U
#define GPIO_GPFCSEL1_GPIO165_M   0xF00000U     // GPIO165 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO166_S   24U
#define GPIO_GPFCSEL1_GPIO166_M   0xF000000U    // GPIO166 Controller CPU Select
#define GPIO_GPFCSEL1_GPIO167_S   28U
#define GPIO_GPFCSEL1_GPIO167_M   0xF0000000U   // GPIO167 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPFCSEL2_GPIO168_S   0U
#define GPIO_GPFCSEL2_GPIO168_M   0xFU   // GPIO168 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFLOCK register
//
//*************************************************************************************************
#define GPIO_GPFLOCK_GPIO160   0x1U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO161   0x2U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO162   0x4U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO163   0x8U     // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO164   0x10U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO165   0x20U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO166   0x40U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO167   0x80U    // Configuration Lock bit for this pin
#define GPIO_GPFLOCK_GPIO168   0x100U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPFCR register
//
//*************************************************************************************************
#define GPIO_GPFCR_GPIO160   0x1U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO161   0x2U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO162   0x4U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO163   0x8U     // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO164   0x10U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO165   0x20U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO166   0x40U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO167   0x80U    // Configuration lock commit bit for this pin
#define GPIO_GPFCR_GPIO168   0x100U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCTRL register
//
//*************************************************************************************************
#define GPIO_GPGCTRL_QUALPRD0_S   0U
#define GPIO_GPGCTRL_QUALPRD0_M   0xFFU     // Qualification sampling period for GPIO160 to GPIO167
#define GPIO_GPGCTRL_QUALPRD1_S   8U
#define GPIO_GPGCTRL_QUALPRD1_M   0xFF00U   // Qualification sampling period for GPIO168

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPGQSEL1_GPIO198_S   12U
#define GPIO_GPGQSEL1_GPIO198_M   0x3000U       // Select input qualification type for GPIO198
#define GPIO_GPGQSEL1_GPIO199_S   14U
#define GPIO_GPGQSEL1_GPIO199_M   0xC000U       // Select input qualification type for GPIO199
#define GPIO_GPGQSEL1_GPIO200_S   16U
#define GPIO_GPGQSEL1_GPIO200_M   0x30000U      // Select input qualification type for GPIO200
#define GPIO_GPGQSEL1_GPIO201_S   18U
#define GPIO_GPGQSEL1_GPIO201_M   0xC0000U      // Select input qualification type for GPIO201
#define GPIO_GPGQSEL1_GPIO202_S   20U
#define GPIO_GPGQSEL1_GPIO202_M   0x300000U     // Select input qualification type for GPIO202
#define GPIO_GPGQSEL1_GPIO203_S   22U
#define GPIO_GPGQSEL1_GPIO203_M   0xC00000U     // Select input qualification type for GPIO203
#define GPIO_GPGQSEL1_GPIO204_S   24U
#define GPIO_GPGQSEL1_GPIO204_M   0x3000000U    // Select input qualification type for GPIO204
#define GPIO_GPGQSEL1_GPIO205_S   26U
#define GPIO_GPGQSEL1_GPIO205_M   0xC000000U    // Select input qualification type for GPIO205
#define GPIO_GPGQSEL1_GPIO206_S   28U
#define GPIO_GPGQSEL1_GPIO206_M   0x30000000U   // Select input qualification type for GPIO206
#define GPIO_GPGQSEL1_GPIO207_S   30U
#define GPIO_GPGQSEL1_GPIO207_M   0xC0000000U   // Select input qualification type for GPIO207

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPGQSEL2_GPIO208_S   0U
#define GPIO_GPGQSEL2_GPIO208_M   0x3U          // Select input qualification type for GPIO208
#define GPIO_GPGQSEL2_GPIO209_S   2U
#define GPIO_GPGQSEL2_GPIO209_M   0xCU          // Select input qualification type for GPIO209
#define GPIO_GPGQSEL2_GPIO210_S   4U
#define GPIO_GPGQSEL2_GPIO210_M   0x30U         // Select input qualification type for GPIO210
#define GPIO_GPGQSEL2_GPIO211_S   6U
#define GPIO_GPGQSEL2_GPIO211_M   0xC0U         // Select input qualification type for GPIO211
#define GPIO_GPGQSEL2_GPIO212_S   8U
#define GPIO_GPGQSEL2_GPIO212_M   0x300U        // Select input qualification type for GPIO212
#define GPIO_GPGQSEL2_GPIO213_S   10U
#define GPIO_GPGQSEL2_GPIO213_M   0xC00U        // Select input qualification type for GPIO213
#define GPIO_GPGQSEL2_GPIO214_S   12U
#define GPIO_GPGQSEL2_GPIO214_M   0x3000U       // Select input qualification type for GPIO214
#define GPIO_GPGQSEL2_GPIO215_S   14U
#define GPIO_GPGQSEL2_GPIO215_M   0xC000U       // Select input qualification type for GPIO215
#define GPIO_GPGQSEL2_GPIO216_S   16U
#define GPIO_GPGQSEL2_GPIO216_M   0x30000U      // Select input qualification type for GPIO216
#define GPIO_GPGQSEL2_GPIO217_S   18U
#define GPIO_GPGQSEL2_GPIO217_M   0xC0000U      // Select input qualification type for GPIO217
#define GPIO_GPGQSEL2_GPIO218_S   20U
#define GPIO_GPGQSEL2_GPIO218_M   0x300000U     // Select input qualification type for GPIO218
#define GPIO_GPGQSEL2_GPIO219_S   22U
#define GPIO_GPGQSEL2_GPIO219_M   0xC00000U     // Select input qualification type for GPIO219
#define GPIO_GPGQSEL2_GPIO220_S   24U
#define GPIO_GPGQSEL2_GPIO220_M   0x3000000U    // Select input qualification type for GPIO220
#define GPIO_GPGQSEL2_GPIO221_S   26U
#define GPIO_GPGQSEL2_GPIO221_M   0xC000000U    // Select input qualification type for GPIO221
#define GPIO_GPGQSEL2_GPIO222_S   28U
#define GPIO_GPGQSEL2_GPIO222_M   0x30000000U   // Select input qualification type for GPIO222
#define GPIO_GPGQSEL2_GPIO223_S   30U
#define GPIO_GPGQSEL2_GPIO223_M   0xC0000000U   // Select input qualification type for GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPGMUX1_GPIO198_S   12U
#define GPIO_GPGMUX1_GPIO198_M   0x3000U       // Defines pin-muxing selection for GPIO198
#define GPIO_GPGMUX1_GPIO199_S   14U
#define GPIO_GPGMUX1_GPIO199_M   0xC000U       // Defines pin-muxing selection for GPIO199
#define GPIO_GPGMUX1_GPIO200_S   16U
#define GPIO_GPGMUX1_GPIO200_M   0x30000U      // Defines pin-muxing selection for GPIO200
#define GPIO_GPGMUX1_GPIO201_S   18U
#define GPIO_GPGMUX1_GPIO201_M   0xC0000U      // Defines pin-muxing selection for GPIO201
#define GPIO_GPGMUX1_GPIO202_S   20U
#define GPIO_GPGMUX1_GPIO202_M   0x300000U     // Defines pin-muxing selection for GPIO202
#define GPIO_GPGMUX1_GPIO203_S   22U
#define GPIO_GPGMUX1_GPIO203_M   0xC00000U     // Defines pin-muxing selection for GPIO203
#define GPIO_GPGMUX1_GPIO204_S   24U
#define GPIO_GPGMUX1_GPIO204_M   0x3000000U    // Defines pin-muxing selection for GPIO204
#define GPIO_GPGMUX1_GPIO205_S   26U
#define GPIO_GPGMUX1_GPIO205_M   0xC000000U    // Defines pin-muxing selection for GPIO205
#define GPIO_GPGMUX1_GPIO206_S   28U
#define GPIO_GPGMUX1_GPIO206_M   0x30000000U   // Defines pin-muxing selection for GPIO206
#define GPIO_GPGMUX1_GPIO207_S   30U
#define GPIO_GPGMUX1_GPIO207_M   0xC0000000U   // Defines pin-muxing selection for GPIO207

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPGMUX2_GPIO208_S   0U
#define GPIO_GPGMUX2_GPIO208_M   0x3U          // Defines pin-muxing selection for GPIO208
#define GPIO_GPGMUX2_GPIO209_S   2U
#define GPIO_GPGMUX2_GPIO209_M   0xCU          // Defines pin-muxing selection for GPIO209
#define GPIO_GPGMUX2_GPIO210_S   4U
#define GPIO_GPGMUX2_GPIO210_M   0x30U         // Defines pin-muxing selection for GPIO210
#define GPIO_GPGMUX2_GPIO211_S   6U
#define GPIO_GPGMUX2_GPIO211_M   0xC0U         // Defines pin-muxing selection for GPIO211
#define GPIO_GPGMUX2_GPIO212_S   8U
#define GPIO_GPGMUX2_GPIO212_M   0x300U        // Defines pin-muxing selection for GPIO212
#define GPIO_GPGMUX2_GPIO213_S   10U
#define GPIO_GPGMUX2_GPIO213_M   0xC00U        // Defines pin-muxing selection for GPIO213
#define GPIO_GPGMUX2_GPIO214_S   12U
#define GPIO_GPGMUX2_GPIO214_M   0x3000U       // Defines pin-muxing selection for GPIO214
#define GPIO_GPGMUX2_GPIO215_S   14U
#define GPIO_GPGMUX2_GPIO215_M   0xC000U       // Defines pin-muxing selection for GPIO215
#define GPIO_GPGMUX2_GPIO216_S   16U
#define GPIO_GPGMUX2_GPIO216_M   0x30000U      // Defines pin-muxing selection for GPIO216
#define GPIO_GPGMUX2_GPIO217_S   18U
#define GPIO_GPGMUX2_GPIO217_M   0xC0000U      // Defines pin-muxing selection for GPIO217
#define GPIO_GPGMUX2_GPIO218_S   20U
#define GPIO_GPGMUX2_GPIO218_M   0x300000U     // Defines pin-muxing selection for GPIO218
#define GPIO_GPGMUX2_GPIO219_S   22U
#define GPIO_GPGMUX2_GPIO219_M   0xC00000U     // Defines pin-muxing selection for GPIO219
#define GPIO_GPGMUX2_GPIO220_S   24U
#define GPIO_GPGMUX2_GPIO220_M   0x3000000U    // Defines pin-muxing selection for GPIO220
#define GPIO_GPGMUX2_GPIO221_S   26U
#define GPIO_GPGMUX2_GPIO221_M   0xC000000U    // Defines pin-muxing selection for GPIO221
#define GPIO_GPGMUX2_GPIO222_S   28U
#define GPIO_GPGMUX2_GPIO222_M   0x30000000U   // Defines pin-muxing selection for GPIO222
#define GPIO_GPGMUX2_GPIO223_S   30U
#define GPIO_GPGMUX2_GPIO223_M   0xC0000000U   // Defines pin-muxing selection for GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGDIR register
//
//*************************************************************************************************
#define GPIO_GPGDIR_GPIO198   0x40U         // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO199   0x80U         // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO200   0x100U        // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO201   0x200U        // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO202   0x400U        // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO203   0x800U        // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO204   0x1000U       // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO205   0x2000U       // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO206   0x4000U       // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO207   0x8000U       // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO208   0x10000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO209   0x20000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO210   0x40000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO211   0x80000U      // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO212   0x100000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO213   0x200000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO214   0x400000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO215   0x800000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO216   0x1000000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO217   0x2000000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO218   0x4000000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO219   0x8000000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO220   0x10000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO221   0x20000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO222   0x40000000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPGDIR_GPIO223   0x80000000U   // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGPUD register
//
//*************************************************************************************************
#define GPIO_GPGPUD_GPIO198   0x40U         // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO199   0x80U         // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO200   0x100U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO201   0x200U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO202   0x400U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO203   0x800U        // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO204   0x1000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO205   0x2000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO206   0x4000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO207   0x8000U       // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO208   0x10000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO209   0x20000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO210   0x40000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO211   0x80000U      // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO212   0x100000U     // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO213   0x200000U     // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO214   0x400000U     // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO215   0x800000U     // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO216   0x1000000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO217   0x2000000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO218   0x4000000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO219   0x8000000U    // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO220   0x10000000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO221   0x20000000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO222   0x40000000U   // Pull-Up Disable control for this pin
#define GPIO_GPGPUD_GPIO223   0x80000000U   // Pull-Up Disable control for this pin

