TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHSET register
//
//*************************************************************************************************
#define GPIO_GPHSET_GPIO224   0x1U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO225   0x2U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO226   0x4U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO227   0x8U       // Output Set bit for this pin
#define GPIO_GPHSET_GPIO228   0x10U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO229   0x20U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO230   0x40U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO231   0x80U      // Output Set bit for this pin
#define GPIO_GPHSET_GPIO232   0x100U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO233   0x200U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO234   0x400U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO235   0x800U     // Output Set bit for this pin
#define GPIO_GPHSET_GPIO236   0x1000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO237   0x2000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO238   0x4000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO239   0x8000U    // Output Set bit for this pin
#define GPIO_GPHSET_GPIO240   0x10000U   // Output Set bit for this pin
#define GPIO_GPHSET_GPIO241   0x20000U   // Output Set bit for this pin
#define GPIO_GPHSET_GPIO242   0x40000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCLEAR register
//
//*************************************************************************************************
#define GPIO_GPHCLEAR_GPIO224   0x1U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO225   0x2U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO226   0x4U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO227   0x8U       // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO228   0x10U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO229   0x20U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO230   0x40U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO231   0x80U      // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO232   0x100U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO233   0x200U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO234   0x400U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO235   0x800U     // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO236   0x1000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO237   0x2000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO238   0x4000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO239   0x8000U    // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO240   0x10000U   // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO241   0x20000U   // Output Clear bit for this pin
#define GPIO_GPHCLEAR_GPIO242   0x40000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPHTOGGLE_GPIO224   0x1U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO225   0x2U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO226   0x4U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO227   0x8U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO228   0x10U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO229   0x20U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO230   0x40U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO231   0x80U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO232   0x100U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO233   0x200U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO234   0x400U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO235   0x800U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO236   0x1000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO237   0x2000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO238   0x4000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO239   0x8000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO240   0x10000U   // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO241   0x20000U   // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO242   0x40000U   // Output Toggle bit for this pin




#endif
